rescue_mission/app/controllers/answers_controller.rb

SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = $1 LIMIT 1  [["id", 1]]
---
  def index
    @question = Question.find(params[:question_id])

SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "answers" ("body", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["body", "alsdjflaksdjflkasjdflkasjdflkasjdflkasjdflkasjdflkasjdfdsa"], ["created_at", "2017-01-11 19:02:17.274307"], ["updated_at", "2017-01-11 19:02:17.274307"]]
---
  def create
    @question = Question.find(params[:question_id])
    @answer = Answer.new(answer_params)
    @answer.question = @question
    if @answer.save