rescue_mission/app/controllers/questions_controller.rb

  def update
    @question = Question.find(params[:id])

    if @question.update(question_params)
---
SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "questions" SET "body" = $1, "title" = $2 WHERE "questions"."id" = 1

  def create
    @question = Question.new(question_params)

    if @question.save
---
INSERT INTO "questions" ("body", "title") VALUES ($1, $2) RETURNING "id"